adafruit/seesaw/lib/samd21/samd21d/atdf/ATSAMD21E17D.atdf
        <register name="PID0" offset="0xFE0" rw="R" size="4" access-size="4" caption="CoreSight">
        </register>
        <register name="PID1" offset="0xFE4" rw="R" size="4" access-size="4" caption="CoreSight">
        </register>
        <register name="PID2" offset="0xFE8" rw="R" size="4" access-size="4" caption="CoreSight">
        </register>
        <register name="PID3" offset="0xFEC" rw="R" size="4" access-size="4" caption="CoreSight">
        </register>
        <register name="CID0" offset="0xFF0" rw="R" size="4" access-size="4" caption="CoreSight">
        </register>
        <register name="CID1" offset="0xFF4" rw="R" size="4" access-size="4" caption="CoreSight">
        </register>
        <register name="CID2" offset="0xFF8" rw="R" size="4" access-size="4" caption="CoreSight">
        </register>
        <register name="CID3" offset="0xFFC" rw="R" size="4" access-size="4" caption="CoreSight">
        </register>
      </register-group>
    </module>
    <module name="NVMCTRL" id="U2207" version="2.b.0" caption="Non-Volatile Memory Controller">
      <register-group name="NVMCTRL" caption="Non-Volatile Memory Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="2" initval="0x0000" caption="Control A">
          <bitfield name="CMD" caption="Command" mask="0x7F" values="NVMCTRL_CTRLA__CMD"/>
          <bitfield name="CMDEX" caption="Command Execution" mask="0xFF00" values="NVMCTRL_CTRLA__CMDEX"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Control B">
          <bitfield name="RWS" caption="NVM Read Wait States" mask="0x1E" values="NVMCTRL_CTRLB__RWS"/>
          <bitfield name="MANW" caption="Manual Write" mask="0x80"/>
          <bitfield name="SLEEPPRM" caption="Power Reduction Mode during Sleep" mask="0x300" values="NVMCTRL_CTRLB__SLEEPPRM"/>
          <bitfield name="READMODE" caption="NVMCTRL Read Mode" mask="0x30000" values="NVMCTRL_CTRLB__READMODE"/>
          <bitfield name="CACHEDIS" caption="Cache Disable" mask="0x40000"/>
        </register>
        <register name="PARAM" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="NVM Parameter">
          <bitfield name="NVMP" caption="NVM Pages" mask="0xFFFF"/>
          <bitfield name="PSZ" caption="Page Size" mask="0x70000" values="NVMCTRL_PARAM__PSZ"/>
          <bitfield name="RWWEEP" caption="RWW EEPROM Pages" mask="0xFFF00000"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="READY" caption="NVM Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="ERROR" caption="Error Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTENSET" offset="0x10" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="READY" caption="NVM Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="ERROR" caption="Error Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTFLAG" offset="0x14" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="READY" caption="NVM Ready" mask="0x1"/>
          <bitfield name="ERROR" caption="Error" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0x18" rw="RW" size="2" initval="0x0000" caption="Status">
          <bitfield name="PRM" caption="Power Reduction Mode" mask="0x1"/>
          <bitfield name="LOAD" caption="NVM Page Buffer Active Loading" mask="0x2"/>
          <bitfield name="PROGE" caption="Programming Error Status" mask="0x4"/>
          <bitfield name="LOCKE" caption="Lock Error Status" mask="0x8"/>
          <bitfield name="NVME" caption="NVM Error" mask="0x10"/>
          <bitfield name="SB" caption="Security Bit Status" mask="0x100"/>
        </register>
        <register name="ADDR" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="Address">
          <bitfield name="ADDR" caption="NVM Address" mask="0x3FFFFF"/>
        </register>
        <register name="LOCK" offset="0x20" rw="RW" size="2" caption="Lock Section">
          <bitfield name="LOCK" caption="Region Lock Bits" mask="0xFFFF"/>
        </register>
      </register-group>
      <value-group name="NVMCTRL_CTRLA__CMD">
        <value name="ER" caption="Erase Row - Erases the row addressed by the ADDR register." value="0x02"/>
        <value name="WP" caption="Write Page - Writes the contents of the page buffer to the page addressed by the ADDR register." value="0x04"/>
        <value name="EAR" caption="Erase Auxiliary Row - Erases the auxiliary row addressed by the ADDR register. This command can be given only when the security bit is not set and only to the user configuration row." value="0x05"/>
        <value name="WAP" caption="Write Auxiliary Page - Writes the contents of the page buffer to the page addressed by the ADDR register. This command can be given only when the security bit is not set and only to the user configuration row." value="0x06"/>
        <value name="SF" caption="Security Flow Command" value="0x0A"/>
        <value name="WL" caption="Write lockbits" value="0x0F"/>
        <value name="RWWEEER" caption="RWW EEPROM area Erase Row - Erases the row addressed by the ADDR register." value="0x1A"/>
        <value name="RWWEEWP" caption="RWW EEPROM Write Page - Writes the contents of the page buffer to the page addressed by the ADDR register." value="0x1C"/>
        <value name="LR" caption="Lock Region - Locks the region containing the address location in the ADDR register." value="0x40"/>
        <value name="UR" caption="Unlock Region - Unlocks the region containing the address location in the ADDR register." value="0x41"/>
        <value name="SPRM" caption="Sets the power reduction mode." value="0x42"/>
        <value name="CPRM" caption="Clears the power reduction mode." value="0x43"/>
        <value name="PBC" caption="Page Buffer Clear - Clears the page buffer." value="0x44"/>
        <value name="SSB" caption="Set Security Bit - Sets the security bit by writing 0x00 to the first byte in the lockbit row." value="0x45"/>
        <value name="INVALL" caption="Invalidate all cache lines." value="0x46"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLA__CMDEX">
        <value name="KEY" caption="Execution Key" value="0xA5"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__READMODE">
        <value name="NO_MISS_PENALTY" caption="The NVM Controller (cache system) does not insert wait states on a cache miss. Gives the best system performance." value="0x0"/>
        <value name="LOW_POWER" caption="Reduces power consumption of the cache system, but inserts a wait state each time there is a cache miss. This mode may not be relevant if CPU performance is required, as the application will be stalled and may lead to increase run time." value="0x1"/>
        <value name="DETERMINISTIC" caption="The cache system ensures that a cache hit or miss takes the same amount of time, determined by the number of programmed flash wait states. This mode can be used for real-time applications that require deterministic execution timings." value="0x2"/>
      </value-group>
